index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-19 Mon 21:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear Algebra Demo Gallery</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Linear Algebra Demo Gallery</h1>
<p>
This is a gallery of demos related to linear algebra that <a href="https://nmmull.github.io">I</a> use for
the course <i>CAS CS 132: Geometric Algorithms</i> at Boston University.
The visuals are implemented in <a href="https://elm-lang.org">Elm</a>.
</p>
<ul class="org-ul">
<li><a id="orgd5cfff9"></a><a href="src/LinearEqThree/index.html">Linear Equation in Three Variables</a><br /></li>
<li><a id="orge5bff62"></a><a href="src/LinearSysThree/index.html">Linear System in Three Variables with Three Equations</a><br /></li>
<li><a id="org3a0af9e"></a><span class="todo TODO">TODO</span> Row operations<br /></li>
<li><a id="org16607f1"></a><span class="todo TODO">TODO</span> Gaussian Elimination<br /></li>
</ul>
</div>
</body>
</html>
